tutorials/incompressible/simpleFoam/BYOG_BC/system/include/meshParameters
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
minX -125; //-5;
maxX 125; //15;
minY -215; //-4;
maxY 215; //4;
minZ 0; //0;
maxZ 200; //8;

//[-19.759192  -27.669327   -2.0264416] to [19.759192  27.449999   7.8110995]

fullminX -375;
fullmaxX 375;
fullminY 125;
fullmaxY 215;
fullminZ 0;
fullmaxZ 200;


// Calculate each component of the exteriorPoint
extPx -125;
extPy -215;
extPz 0;

// Assemble the vector from the calculated components
exteriorPoint ($extPx $extPy $extPz);


// Calculate each component of the interiorPoint
intPx -125;
intPy -215;
intPz 0;

// Assemble the vector from the calculated components
interiorPoint ($intPx $intPy $intPz);
// ************************************************************************* //
